server/java/report-generator/src/test/resources/jmeter-load-test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="3.2" jmeter="3.3 r1808647">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Load Test" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Docx Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">10</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">10</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <longProp name="ThreadGroup.start_time">1510153967000</longProp>
        <longProp name="ThreadGroup.end_time">1510153967000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Docx" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
    &quot;functions&quot;: [&#xd;
        {&#xd;
            &quot;documentation&quot;: {&#xd;
                &quot;english&quot;: &quot;&lt;p xmlns=\&quot;http://www.w3.org/1999/xhtml\&quot;&gt;Lorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor invidunt ut labore et dolore magna aliquyam erat, sed diam voluptua. At vero eos et accusam et justo duo dolores et ea rebum. Stet clita kasd gubergren, no sea takimata sanctus est Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor invidunt ut labore et dolore magna aliquyam erat, sed diam voluptua. &lt;/p&gt;&lt;ol xmlns=\&quot;http://www.w3.org/1999/xhtml\&quot;&gt;&lt;li&gt;sdfsdf&lt;/li&gt;&lt;li&gt;sdfdg&lt;/li&gt;&lt;li&gt;dfgdfd&lt;/li&gt;&lt;/ol&gt;&lt;p xmlns=\&quot;http://www.w3.org/1999/xhtml\&quot;&gt;sdgdfgd sdsfgf HJ&lt;/p&gt;&lt;ul xmlns=\&quot;http://www.w3.org/1999/xhtml\&quot;&gt;&lt;li&gt;hebe&lt;ul xmlns=\&quot;http://www.w3.org/1999/xhtml\&quot;&gt;&lt;li&gt;hebe11&lt;/li&gt;&lt;li&gt;hebe12&lt;/li&gt;&lt;/ul&gt;&lt;/li&gt;&lt;li&gt;hebe2&lt;/li&gt;&lt;li&gt;hebe21&lt;/li&gt;&lt;/ul&gt;&lt;p xmlns=\&quot;http://www.w3.org/1999/xhtml\&quot; class=\&quot;ql-indent-1\&quot;&gt;hebe22&lt;/p&gt;&lt;p xmlns=\&quot;http://www.w3.org/1999/xhtml\&quot;&gt;At vero eos et accusam et justo duo dolores et ea rebum. Stet clita kasd gubergren, no sea takimata sanctus est Lorem ipsum dolor sit kamet&lt;sup&gt;hebe&lt;/sup&gt;.&lt;/p&gt;&lt;p xmlns=\&quot;http://www.w3.org/1999/xhtml\&quot;&gt;&lt;br /&gt;&lt;/p&gt;&lt;p xmlns=\&quot;http://www.w3.org/1999/xhtml\&quot;&gt;&lt;strong&gt;Bold &lt;/strong&gt;&lt;/p&gt;&lt;p xmlns=\&quot;http://www.w3.org/1999/xhtml\&quot;&gt;&lt;em&gt;italic &lt;/em&gt;&lt;/p&gt;&lt;p xmlns=\&quot;http://www.w3.org/1999/xhtml\&quot;&gt;&lt;u&gt;underlined&lt;/u&gt;&lt;/p&gt;&lt;p xmlns=\&quot;http://www.w3.org/1999/xhtml\&quot;&gt;&lt;s&gt;strikethrough&lt;/s&gt;&lt;/p&gt;&lt;p xmlns=\&quot;http://www.w3.org/1999/xhtml\&quot;&gt;super&lt;sup&gt;superscript&lt;/sup&gt;&lt;/p&gt;&lt;p xmlns=\&quot;http://www.w3.org/1999/xhtml\&quot;&gt;sub&lt;sub&gt;subscript&lt;/sub&gt;&lt;/p&gt;&lt;p xmlns=\&quot;http://www.w3.org/1999/xhtml\&quot;&gt;&lt;a href=\&quot;https://google.com\&quot; target=\&quot;_blank\&quot;&gt;sdg&lt;/a&gt;&lt;/p&gt;&quot;,&#xd;
                &quot;german&quot;: &quot;&lt;p xmlns=\&quot;http://www.w3.org/1999/xhtml\&quot;&gt;Lorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor invidunt ut labore et dolore magna aliquyam erat, sed diam voluptua. At vero eos et accusam et justo duo dolores et ea rebum. Stet clita kasd gubergren, no sea takimata sanctus est Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor invidunt ut labore et dolore magna aliquyam erat, sed diam voluptua. &lt;/p&gt;&lt;p xmlns=\&quot;http://www.w3.org/1999/xhtml\&quot;&gt;&lt;br /&gt;&lt;/p&gt;&lt;p xmlns=\&quot;http://www.w3.org/1999/xhtml\&quot;&gt;At vero eos et accusam et justo duo dolores et ea rebum. Stet clita kasd gubergren, no sea takimata sanctus est Lorem ipsum dolor sit amet.&lt;/p&gt;&lt;p xmlns=\&quot;http://www.w3.org/1999/xhtml\&quot;&gt;&lt;br /&gt;&lt;/p&gt;&lt;p xmlns=\&quot;http://www.w3.org/1999/xhtml\&quot;&gt;asdfkhjkjfhdkghj&lt;/p&gt;&quot;&#xd;
            },&#xd;
            &quot;inputDataType&quot;: &quot;myComplexType&quot;,&#xd;
            &quot;name&quot;: &quot;New Function&quot;,&#xd;
            &quot;outputDataType&quot;: &quot;tyep232&quot;&#xd;
        }&#xd;
    ],&#xd;
    &quot;project&quot;: {&#xd;
        &quot;documentation&quot;: {&#xd;
            &quot;english&quot;: &quot;&lt;p xmlns=\&quot;http://www.w3.org/1999/xhtml\&quot;&gt;&lt;br /&gt;&lt;/p&gt;&quot;,&#xd;
            &quot;german&quot;: &quot;&lt;p xmlns=\&quot;http://www.w3.org/1999/xhtml\&quot;&gt;&lt;br /&gt;&lt;/p&gt;&quot;&#xd;
        },&#xd;
        &quot;title&quot;: &quot;Christians Lieblings VDV-Schrift&quot;&#xd;
    },&#xd;
    &quot;sequences&quot;: [],&#xd;
    &quot;services&quot;: [&#xd;
        {&#xd;
            &quot;documentation&quot;: {&#xd;
                &quot;english&quot;: &quot;&lt;p xmlns=\&quot;http://www.w3.org/1999/xhtml\&quot;&gt;Lorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor invidunt ut labore et dolore magna aliquyam erat, sed diam voluptua. At vero eos et accusam et justo duo dolores et ea rebum. Stet clita kasd gubergren, no sea takimata sanctus est Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor invidunt ut labore et dolore magna aliquyam erat, sed diam voluptua. At vero eos et accusam et justo duo dolores et ea rebum. Stet clita kasd gubergren, no sea takimata sanctus est Lorem ipsum dolor sit amet.&lt;/p&gt;&quot;,&#xd;
                &quot;german&quot;: &quot;&lt;p xmlns=\&quot;http://www.w3.org/1999/xhtml\&quot;&gt;Lorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor invidunt ut labore et dolore magna aliquyam erat, sed diam voluptua. At vero eos et accusam et justo duo dolores et ea rebum. Stet clita kasd gubergren, no sea takimata sanctus est Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor invidunt ut labore et dolore magna aliquyam erat, sed diam voluptua. At vero eos et accusam et justo duo dolores et ea rebum. Stet clita kasd gubergren, no sea takimata sanctus est Lorem ipsum dolor sit amet.&lt;/p&gt;&quot;&#xd;
            },&#xd;
            &quot;functions&quot;: [&#xd;
                &quot;New Function&quot;&#xd;
            ],&#xd;
            &quot;name&quot;: &quot;New Service&quot;,&#xd;
            &quot;sequences&quot;: []&#xd;
        }&#xd;
    ],&#xd;
    &quot;xsd&quot;: &quot;&lt;?xml version=\&quot;1.0\&quot;?&gt;\n&lt;schema xmlns=\&quot;http://www.w3.org/2001/XMLSchema\&quot; targetNamespace=\&quot;http://dimo-omp.de\&quot; xmlns:blub=\&quot;http://dimo-omp.de\&quot;&gt;\n  &lt;group name=\&quot;groupType\&quot;&gt;\n    &lt;annotation&gt;\n      &lt;documentation&gt;sdfgdfgdfg sdfgfd&lt;/documentation&gt;\n    &lt;/annotation&gt;\n    &lt;sequence&gt;\n      &lt;element name=\&quot;blaasd\&quot; type=\&quot;string\&quot;/&gt;\n    &lt;/sequence&gt;\n  &lt;/group&gt;\n  &lt;complexType name=\&quot;tyep232\&quot;&gt;\n    &lt;sequence&gt;\n      &lt;group ref=\&quot;blub:groupType\&quot;/&gt;\n      &lt;element name=\&quot;asd\&quot; type=\&quot;string\&quot;/&gt;\n    &lt;/sequence&gt;\n  &lt;/complexType&gt;\n  &lt;complexType name=\&quot;myComplexType\&quot;&gt;\n    &lt;sequence&gt;\n      &lt;group ref=\&quot;blub:groupType\&quot;/&gt;\n      &lt;element name=\&quot;element1\&quot; type=\&quot;string\&quot;/&gt;\n    &lt;/sequence&gt;\n  &lt;/complexType&gt;\n&lt;/schema&gt;&quot;&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">8080</stringProp>
          <stringProp name="HTTPSampler.path">report-async</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Accept</stringProp>
              <stringProp name="Header.value">application/vnd.openxmlformats-officedocument.wordprocessingml.document</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Pdf Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">10</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">10</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <longProp name="ThreadGroup.start_time">1510153967000</longProp>
        <longProp name="ThreadGroup.end_time">1510153967000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Pdf" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
    &quot;functions&quot;: [&#xd;
        {&#xd;
            &quot;documentation&quot;: {&#xd;
                &quot;english&quot;: &quot;&lt;p xmlns=\&quot;http://www.w3.org/1999/xhtml\&quot;&gt;Lorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor invidunt ut labore et dolore magna aliquyam erat, sed diam voluptua. At vero eos et accusam et justo duo dolores et ea rebum. Stet clita kasd gubergren, no sea takimata sanctus est Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor invidunt ut labore et dolore magna aliquyam erat, sed diam voluptua. &lt;/p&gt;&lt;ol xmlns=\&quot;http://www.w3.org/1999/xhtml\&quot;&gt;&lt;li&gt;sdfsdf&lt;/li&gt;&lt;li&gt;sdfdg&lt;/li&gt;&lt;li&gt;dfgdfd&lt;/li&gt;&lt;/ol&gt;&lt;p xmlns=\&quot;http://www.w3.org/1999/xhtml\&quot;&gt;sdgdfgd sdsfgf HJ&lt;/p&gt;&lt;ul xmlns=\&quot;http://www.w3.org/1999/xhtml\&quot;&gt;&lt;li&gt;hebe&lt;ul xmlns=\&quot;http://www.w3.org/1999/xhtml\&quot;&gt;&lt;li&gt;hebe11&lt;/li&gt;&lt;li&gt;hebe12&lt;/li&gt;&lt;/ul&gt;&lt;/li&gt;&lt;li&gt;hebe2&lt;/li&gt;&lt;li&gt;hebe21&lt;/li&gt;&lt;/ul&gt;&lt;p xmlns=\&quot;http://www.w3.org/1999/xhtml\&quot; class=\&quot;ql-indent-1\&quot;&gt;hebe22&lt;/p&gt;&lt;p xmlns=\&quot;http://www.w3.org/1999/xhtml\&quot;&gt;At vero eos et accusam et justo duo dolores et ea rebum. Stet clita kasd gubergren, no sea takimata sanctus est Lorem ipsum dolor sit kamet&lt;sup&gt;hebe&lt;/sup&gt;.&lt;/p&gt;&lt;p xmlns=\&quot;http://www.w3.org/1999/xhtml\&quot;&gt;&lt;br /&gt;&lt;/p&gt;&lt;p xmlns=\&quot;http://www.w3.org/1999/xhtml\&quot;&gt;&lt;strong&gt;Bold &lt;/strong&gt;&lt;/p&gt;&lt;p xmlns=\&quot;http://www.w3.org/1999/xhtml\&quot;&gt;&lt;em&gt;italic &lt;/em&gt;&lt;/p&gt;&lt;p xmlns=\&quot;http://www.w3.org/1999/xhtml\&quot;&gt;&lt;u&gt;underlined&lt;/u&gt;&lt;/p&gt;&lt;p xmlns=\&quot;http://www.w3.org/1999/xhtml\&quot;&gt;&lt;s&gt;strikethrough&lt;/s&gt;&lt;/p&gt;&lt;p xmlns=\&quot;http://www.w3.org/1999/xhtml\&quot;&gt;super&lt;sup&gt;superscript&lt;/sup&gt;&lt;/p&gt;&lt;p xmlns=\&quot;http://www.w3.org/1999/xhtml\&quot;&gt;sub&lt;sub&gt;subscript&lt;/sub&gt;&lt;/p&gt;&lt;p xmlns=\&quot;http://www.w3.org/1999/xhtml\&quot;&gt;&lt;a href=\&quot;https://google.com\&quot; target=\&quot;_blank\&quot;&gt;sdg&lt;/a&gt;&lt;/p&gt;&quot;,&#xd;
                &quot;german&quot;: &quot;&lt;p xmlns=\&quot;http://www.w3.org/1999/xhtml\&quot;&gt;Lorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor invidunt ut labore et dolore magna aliquyam erat, sed diam voluptua. At vero eos et accusam et justo duo dolores et ea rebum. Stet clita kasd gubergren, no sea takimata sanctus est Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor invidunt ut labore et dolore magna aliquyam erat, sed diam voluptua. &lt;/p&gt;&lt;p xmlns=\&quot;http://www.w3.org/1999/xhtml\&quot;&gt;&lt;br /&gt;&lt;/p&gt;&lt;p xmlns=\&quot;http://www.w3.org/1999/xhtml\&quot;&gt;At vero eos et accusam et justo duo dolores et ea rebum. Stet clita kasd gubergren, no sea takimata sanctus est Lorem ipsum dolor sit amet.&lt;/p&gt;&lt;p xmlns=\&quot;http://www.w3.org/1999/xhtml\&quot;&gt;&lt;br /&gt;&lt;/p&gt;&lt;p xmlns=\&quot;http://www.w3.org/1999/xhtml\&quot;&gt;asdfkhjkjfhdkghj&lt;/p&gt;&quot;&#xd;
            },&#xd;
            &quot;inputDataType&quot;: &quot;myComplexType&quot;,&#xd;
            &quot;name&quot;: &quot;New Function&quot;,&#xd;
            &quot;outputDataType&quot;: &quot;tyep232&quot;&#xd;
        }&#xd;
    ],&#xd;
    &quot;project&quot;: {&#xd;
        &quot;documentation&quot;: {&#xd;
            &quot;english&quot;: &quot;&lt;p xmlns=\&quot;http://www.w3.org/1999/xhtml\&quot;&gt;&lt;br /&gt;&lt;/p&gt;&quot;,&#xd;
            &quot;german&quot;: &quot;&lt;p xmlns=\&quot;http://www.w3.org/1999/xhtml\&quot;&gt;&lt;br /&gt;&lt;/p&gt;&quot;&#xd;
        },&#xd;
        &quot;title&quot;: &quot;Christians Lieblings VDV-Schrift&quot;&#xd;
    },&#xd;
    &quot;sequences&quot;: [],&#xd;
    &quot;services&quot;: [&#xd;
        {&#xd;
            &quot;documentation&quot;: {&#xd;
                &quot;english&quot;: &quot;&lt;p xmlns=\&quot;http://www.w3.org/1999/xhtml\&quot;&gt;Lorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor invidunt ut labore et dolore magna aliquyam erat, sed diam voluptua. At vero eos et accusam et justo duo dolores et ea rebum. Stet clita kasd gubergren, no sea takimata sanctus est Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor invidunt ut labore et dolore magna aliquyam erat, sed diam voluptua. At vero eos et accusam et justo duo dolores et ea rebum. Stet clita kasd gubergren, no sea takimata sanctus est Lorem ipsum dolor sit amet.&lt;/p&gt;&quot;,&#xd;
                &quot;german&quot;: &quot;&lt;p xmlns=\&quot;http://www.w3.org/1999/xhtml\&quot;&gt;Lorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor invidunt ut labore et dolore magna aliquyam erat, sed diam voluptua. At vero eos et accusam et justo duo dolores et ea rebum. Stet clita kasd gubergren, no sea takimata sanctus est Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor invidunt ut labore et dolore magna aliquyam erat, sed diam voluptua. At vero eos et accusam et justo duo dolores et ea rebum. Stet clita kasd gubergren, no sea takimata sanctus est Lorem ipsum dolor sit amet.&lt;/p&gt;&quot;&#xd;
            },&#xd;
            &quot;functions&quot;: [&#xd;
                &quot;New Function&quot;&#xd;
            ],&#xd;
            &quot;name&quot;: &quot;New Service&quot;,&#xd;
            &quot;sequences&quot;: []&#xd;
        }&#xd;
    ],&#xd;
    &quot;xsd&quot;: &quot;&lt;?xml version=\&quot;1.0\&quot;?&gt;\n&lt;schema xmlns=\&quot;http://www.w3.org/2001/XMLSchema\&quot; targetNamespace=\&quot;http://dimo-omp.de\&quot; xmlns:blub=\&quot;http://dimo-omp.de\&quot;&gt;\n  &lt;group name=\&quot;groupType\&quot;&gt;\n    &lt;annotation&gt;\n      &lt;documentation&gt;sdfgdfgdfg sdfgfd&lt;/documentation&gt;\n    &lt;/annotation&gt;\n    &lt;sequence&gt;\n      &lt;element name=\&quot;blaasd\&quot; type=\&quot;string\&quot;/&gt;\n    &lt;/sequence&gt;\n  &lt;/group&gt;\n  &lt;complexType name=\&quot;tyep232\&quot;&gt;\n    &lt;sequence&gt;\n      &lt;group ref=\&quot;blub:groupType\&quot;/&gt;\n      &lt;element name=\&quot;asd\&quot; type=\&quot;string\&quot;/&gt;\n    &lt;/sequence&gt;\n  &lt;/complexType&gt;\n  &lt;complexType name=\&quot;myComplexType\&quot;&gt;\n    &lt;sequence&gt;\n      &lt;group ref=\&quot;blub:groupType\&quot;/&gt;\n      &lt;element name=\&quot;element1\&quot; type=\&quot;string\&quot;/&gt;\n    &lt;/sequence&gt;\n  &lt;/complexType&gt;\n&lt;/schema&gt;&quot;&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">8080</stringProp>
          <stringProp name="HTTPSampler.path">report-async</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Accept</stringProp>
              <stringProp name="Header.value">application/pdf</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
      <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
    <WorkBench guiclass="WorkBenchGui" testclass="WorkBench" testname="WorkBench" enabled="true">
      <boolProp name="WorkBench.save">true</boolProp>
    </WorkBench>
    <hashTree/>
  </hashTree>
</jmeterTestPlan>